{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "46653752",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import sys\n",
    "import configparser\n",
    "\n",
    "project_root = os.path.abspath(os.path.join(os.getcwd(), \"../\"))\n",
    "sys.path.append(project_root)\n",
    "\n",
    "from database.neo4j_db import Neo4jGraphDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fce7c967",
   "metadata": {},
   "source": [
    "# Database Configuration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "aaf5e7a9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total number of nodes in the Neo4j database: 93325\n"
     ]
    }
   ],
   "source": [
    "config = configparser.ConfigParser()\n",
    "config.read('../config.ini')\n",
    "neo4j_graph = Neo4jGraphDB(database=config[\"neo4j\"][\"database\"])\n",
    "driver = neo4j_graph._driver\n",
    "with driver.session(database=neo4j_graph._database) as session:\n",
    "    result = session.run(\"MATCH (n) RETURN count(n) AS node_count\")\n",
    "    node_count = result.single()[\"node_count\"]\n",
    "print(f\"Total number of nodes in the Neo4j database: {node_count}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0fe7a4a6",
   "metadata": {},
   "source": [
    "# Data Exploration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c8da1b0d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Disease: Lyme disease\n",
      "Phenotypes (UMLS→ICD mapped): ['Dermal atrophy', 'Peripheral neuropathy', 'Meningitis', 'Atypical behavior', 'Uveitis', 'Nausea and vomiting', 'Arrhythmia', 'Memory impairment', 'Headache', 'Arthritis', 'Fever', 'Atrioventricular block', 'Myalgia', 'Arthralgia', 'Fatigue', 'Insomnia', 'Amaurosis fugax']\n",
      "All Phenotypes: ['Dermal atrophy', 'Peripheral neuropathy', 'Meningitis', 'Muscle weakness', 'Photophobia', 'Atypical behavior', 'Uveitis', 'Nausea and vomiting', 'Arrhythmia', 'Infectious encephalitis', 'Memory impairment', 'Headache', 'Skin nodule', 'Joint swelling', 'Arthritis', 'Fever', 'Atrioventricular block', 'Myalgia', 'Paresthesia', 'Arthralgia', 'Cranial nerve paralysis', 'Fatigue', 'Insomnia', 'Amaurosis fugax']\n",
      "Other Phenotypes: ['Muscle weakness', 'Photophobia', 'Infectious encephalitis', 'Skin nodule', 'Joint swelling', 'Paresthesia', 'Cranial nerve paralysis']\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Lyme disease (mapped and non-mapped) phenotypes\n",
    "with driver.session(database=neo4j_graph._database) as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (d:HpoDisease)\n",
    "    WHERE d.label CONTAINS \"Lyme\"\n",
    "\n",
    "    // 1) ALL phenotypes for the disease\n",
    "    OPTIONAL MATCH (d)-[:HAS_PHENOTYPIC_FEATURE]->(r_all)\n",
    "    WITH d, collect(DISTINCT r_all.label) AS allPhenotypes\n",
    "\n",
    "    // 2) ONLY phenotypes that satisfy UMLS→ICD\n",
    "    OPTIONAL MATCH (d)-[:HAS_PHENOTYPIC_FEATURE]->(r)\n",
    "    <-[:UMLS_TO_HPO_PHENOTYPE]-(x:UMLS)-[:UMLS_TO_ICD]-()\n",
    "    WITH d, allPhenotypes, collect(DISTINCT r.label) AS phenotypes\n",
    "\n",
    "    // 3) Difference: in allPhenotypes but NOT in phenotypes\n",
    "    WITH d, phenotypes, allPhenotypes,\n",
    "        [p IN allPhenotypes WHERE NOT p IN phenotypes] AS otherPhenotypes\n",
    "\n",
    "    RETURN d.label AS disease,\n",
    "        phenotypes,        // filtered by UMLS→ICD\n",
    "        allPhenotypes,     // full set\n",
    "        otherPhenotypes    // full minus filtered\n",
    "    ORDER BY size(disease) ASC;\n",
    "    \"\"\"\n",
    "    result = session.run(query)\n",
    "    for record in result:\n",
    "        disease = record[\"disease\"]\n",
    "        phenotypes = record[\"phenotypes\"]\n",
    "        all_phenotypes = record[\"allPhenotypes\"]\n",
    "        other_phenotypes = record[\"otherPhenotypes\"]\n",
    "        print(f\"Disease: {disease}\")\n",
    "        print(f\"Phenotypes (UMLS→ICD mapped): {phenotypes}\")\n",
    "        print(f\"All Phenotypes: {all_phenotypes}\")\n",
    "        print(f\"Other Phenotypes: {other_phenotypes}\")\n",
    "        print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ca7e0bde",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Phenotype: Dermal atrophy\n",
      "Subclasses with UMLS→ICD mapping: ['Striae distensae']\n",
      "\n",
      "Phenotype: Peripheral neuropathy\n",
      "Subclasses with UMLS→ICD mapping: ['Polyneuropathy', 'Mononeuropathy', 'Constrictive median neuropathy', 'Multiple mononeuropathy']\n",
      "\n",
      "Phenotype: Meningitis\n",
      "Subclasses with UMLS→ICD mapping: ['Fungal meningitis', 'Cryptococcal meningitis', 'Coccidioidal meningitis']\n",
      "\n",
      "Phenotype: Atypical behavior\n",
      "Subclasses with UMLS→ICD mapping: ['Hair-pulling', 'Nail-biting', 'Bruxism', 'Disinhibition', 'Hyperactivity', 'Attention deficit hyperactivity disorder', 'Aggressive behavior', 'Violent behavior', 'Oppositional defiant disorder', 'Nail-biting', 'Compulsive stealing', 'Excessive fire setting', 'Anorexia', 'Polydipsia', 'Polyphagia', 'Bulimia', 'Addictive nicotine use', 'Addictive cocaine use', 'Addictive opioid use', 'Addictive cannabis use', 'Addictive alcohol use', 'Addictive gambling behavior', 'Personality disorder', 'Histrionic personality disorder', 'Borderline personality disorder', 'Autistic behavior', 'Autism', 'Bipolar affective disorder', 'Schizophrenia', 'Diminishment of relationship seeking', 'Pseudoseizure']\n",
      "\n",
      "Phenotype: Uveitis\n",
      "Subclasses with UMLS→ICD mapping: ['Iridocyclitis', 'Posterior uveitis']\n",
      "\n",
      "Phenotype: Nausea and vomiting\n",
      "Subclasses with UMLS→ICD mapping: ['Vomiting', 'Nausea']\n",
      "\n",
      "Phenotype: Arrhythmia\n",
      "Subclasses with UMLS→ICD mapping: ['Sinus bradycardia', 'Sick sinus syndrome', 'Sinoatrial block', 'Wolff-Parkinson-White syndrome', 'Premature ventricular contraction', 'Tachycardia', 'Ventricular tachycardia', 'Supraventricular tachycardia', 'Paroxysmal tachycardia', 'Typical atrial flutter', 'Permanent atrial fibrillation', 'Paroxysmal atrial fibrillation', 'Supraventricular tachycardia', 'Premature atrial contractions', 'Palpitations', 'Cardiac arrest', 'Bradycardia', 'Sinus bradycardia']\n",
      "\n",
      "Phenotype: Memory impairment\n",
      "Subclasses with UMLS→ICD mapping: ['Transient global amnesia', 'Anterograde memory impairment', 'Retrograde memory impairment']\n",
      "\n",
      "Phenotype: Headache\n",
      "Subclasses with UMLS→ICD mapping: ['Migraine', 'Migraine with aura', 'Migraine without aura', 'Cluster headache', 'Tension-type headache']\n",
      "\n",
      "Phenotype: Arthritis\n",
      "Subclasses with UMLS→ICD mapping: ['Rheumatoid arthritis', 'Juvenile rheumatoid arthritis', 'Gout', 'Podagra', 'Septic arthritis', 'Osteoarthritis', 'Knee osteoarthritis', 'Osteoarthritis of the first carpometacarpal joint', 'Hip osteoarthritis']\n",
      "\n",
      "Phenotype: Fever\n",
      "Subclasses with UMLS→ICD mapping: ['Recurrent fever', 'Hyperpyrexia', 'Persistent fever']\n",
      "\n",
      "Phenotype: Atrioventricular block\n",
      "Subclasses with UMLS→ICD mapping: ['Third degree atrioventricular block', 'First degree atrioventricular block', 'Second degree atrioventricular block', 'Mobitz I atrioventricular block']\n",
      "\n",
      "Phenotype: Myalgia\n",
      "Subclasses with UMLS→ICD mapping: []\n",
      "\n",
      "Phenotype: Arthralgia\n",
      "Subclasses with UMLS→ICD mapping: []\n",
      "\n",
      "Phenotype: Fatigue\n",
      "Subclasses with UMLS→ICD mapping: []\n",
      "\n",
      "Phenotype: Insomnia\n",
      "Subclasses with UMLS→ICD mapping: []\n",
      "\n",
      "Phenotype: Amaurosis fugax\n",
      "Subclasses with UMLS→ICD mapping: []\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Check if subclasses of the phenotypes have mapping wiht ICD\n",
    "mapped_phenotypes = ['Dermal atrophy', 'Peripheral neuropathy', 'Meningitis', 'Atypical behavior', 'Uveitis', 'Nausea and vomiting', 'Arrhythmia', 'Memory impairment', 'Headache', 'Arthritis', 'Fever', 'Atrioventricular block', 'Myalgia', 'Arthralgia', 'Fatigue', 'Insomnia', 'Amaurosis fugax']\n",
    "with driver.session(database=neo4j_graph._database) as session:\n",
    "    for phenotype in mapped_phenotypes:\n",
    "        query = \"\"\"\n",
    "        MATCH (p:HpoPhenotype {label: $phenotype})\n",
    "        OPTIONAL MATCH (p)<-[:SUBCLASSOF*]-(subclass:HpoPhenotype)\n",
    "        WHERE EXISTS {\n",
    "            MATCH (subclass)<-[:UMLS_TO_HPO_PHENOTYPE]-(u:UMLS)-[:UMLS_TO_ICD]-()\n",
    "        }\n",
    "        RETURN subclass.label AS subclass_label\n",
    "        \"\"\"\n",
    "        result = session.run(query, phenotype=phenotype)\n",
    "        subclasses_with_icd = [record[\"subclass_label\"] for record in result if record[\"subclass_label\"] is not None]\n",
    "        print(f\"Phenotype: {phenotype}\")\n",
    "        print(f\"Subclasses with UMLS→ICD mapping: {subclasses_with_icd}\")\n",
    "        print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
